#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_caller_identity.current: Reading...
aws_vpc.this: Refreshing state... [id=vpc-0870bffca2421a1e1]
data.aws_iam_policy_document.assume_role: Reading...
aws_cloudwatch_log_group.cw_loggroup: Refreshing state... [id=vpc-flowlog]
data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3760307347]
aws_iam_role.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role]
data.aws_caller_identity.current: Read complete after 1s [id=796344116454]
data.aws_iam_policy_document.vpc_flowlog_policy: Reading...
data.aws_iam_policy_document.vpc_flowlog_policy: Read complete after 0s [id=4098687544]
aws_iam_role_policy.vpc_flowlog_role: Refreshing state... [id=vpc_flowlog_role:vpc_flowlog_role]
aws_flow_log.app1: Refreshing state... [id=fl-0c0bee9d4170ad2b1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_flow_log.app1 must be replaced
-/+ resource "aws_flow_log" "app1" {
      ~ arn                      = "arn:aws:ec2:us-east-2:796344116454:vpc-flow-log/fl-0c0bee9d4170ad2b1" -> (known after apply)
      ~ id                       = "fl-0c0bee9d4170ad2b1" -> (known after apply)
      ~ log_format               = "${version} ${account-id} ${interface-id} ${srcaddr} ${dstaddr} ${srcport} ${dstport} ${protocol} ${packets} ${bytes} ${start} ${end} ${action} ${log-status}" -> (known after apply)
      ~ log_group_name           = "vpc-flowlog" -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
      ~ vpc_id                   = "vpc-0870bffca2421a1e1" -> (known after apply) # forces replacement
        # (5 unchanged attributes hidden)
    }

  # aws_vpc.this must be replaced
-/+ resource "aws_vpc" "this" {
      ~ arn                                  = "arn:aws:ec2:us-east-2:796344116454:vpc/vpc-0870bffca2421a1e1" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.20.20.0/27" -> "10.20.20.0/28" # forces replacement
      ~ default_network_acl_id               = "acl-0fb1333aaf635b387" -> (known after apply)
      ~ default_route_table_id               = "rtb-0c51e0f0d77ce5fe3" -> (known after apply)
      ~ default_security_group_id            = "sg-04aaa61e9fba4173c" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-086e54fa160de6b63" -> (known after apply)
      ~ enable_classiclink                   = false -> (known after apply)
      ~ enable_classiclink_dns_support       = false -> (known after apply)
      ~ id                                   = "vpc-0870bffca2421a1e1" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0c51e0f0d77ce5fe3" -> (known after apply)
      ~ owner_id                             = "796344116454" -> (known after apply)
        tags                                 = {
            "Name" = "application-test-project"
        }
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @kunduso-aws, Action: `pull_request`*